import json

file_name=['dev.json','dev (2).json','test (2).json','test.json','train.json']
file_name2=['train (2).json']
ans=[]

str_features=[[],
    [],#1 姓名（忽略）：['赵','钱','孙','李','周','吴','郑','王','冯','陈','褚','卫','蒋','沈','韩','杨','朱','秦','尤','许','何','吕','施','张','孔','曹','严','华','金','魏','陶','姜','戚','谢','邹','喻','柏','水','窦','章','云','苏','潘','葛','奚','范','彭','郎','鲁','韦','昌','马','苗','凤','花','方','俞','任','袁','柳','酆','鲍','史','唐','费','廉','岑','薛','雷','贺','倪','汤','滕','殷','罗','毕','郝','邬','安','常','乐','于','时','傅','皮','卞','齐','康','伍','余','元','卜','顾','孟','平','黄','和','穆','萧','尹','姚','邵','湛','汪','祁','毛','禹','狄','米','贝','明','臧','计','伏','成','戴','谈','宋','茅','庞','熊','纪','舒','屈','项','祝','董','梁','杜','阮','蓝','闵','席','季','麻','强','贾','路','娄','危','江','童','颜','郭','梅','盛','林','刁','钟','丘','徐','邱','骆','高','夏','蔡','田','樊','胡','凌','霍','虞','万','支','柯','昝','管','卢','莫','经','房','裘','缪','干','解','应','宗','丁','宣','贲','邓','单','杭','洪','包','诸','左','石','崔','吉','钮','龚','程','嵇','邢','滑','裴','陆','荣','翁','荀','羊','於','惠','甄','曲','家','封','芮','羿','储','靳','汲','邴','糜','松','井','段','富','巫','乌','焦','巴','弓','牧','隗','山','谷','车','侯','宓','蓬','全','郗','班','仰','秋','仲','伊','宫','宁','仇','栾','暴','甘','钭','厉','戎','祖','武','符','刘','景','詹','束','龙','叶','幸','司','韶','郜','黎','蓟','薄','印','宿','白','怀','蒲','台','从','鄂','索','咸','籍','赖','卓','蔺','屠','蒙','池','乔','阴','郁','胥','能','苍','双','闻','莘','党','翟','谭','贡','劳','逢','逄','姬','申','扶','堵','冉','宰','郦','雍','郤','璩','桑','桂','濮','牛','寿','通','边','扈','燕','冀','郏','浦','尚','农','温','别','庄','晏','柴','瞿','阎','充','慕','连','茹','习','宦','艾','鱼','容','向','古','易','慎','戈','廖','庚','终','暨','居','衡','步','都','耿','满','弘','匡','国','文','寇','广','禄','阙','东','欧','殳','沃','利','蔚','越','夔','隆','师','巩','厍','聂','晁','勾','敖','融','冷','訾','辛','阚','那','简','饶','空','曾','毋','沙','乜','养','鞠','须','丰','巢','关','蒯','相','查','荆','红','游','竺','权','逯','盖','益','桓','公','万俟','司马','上官','欧阳','夏侯','诸葛','闻人','东方','赫连','皇甫','尉迟','公羊','澹台','公冶','宗政','濮阳','淳于','单于','太叔','申屠','公孙','仲孙','轩辕','令狐','钟离','宇文','长孙','慕容','鲜于','闾丘','司徒','司空','亓官','司寇','仉','督','子车','颛孙','端木','巫马','公西','漆雕','乐正','壤驷','公良','拓拔','夹谷','宰父','谷粱','晋','楚','阎','法','汝','鄢','涂','钦','段干','百里','东郭','南门','呼延','归','海','羊舌','微生','岳','帅','缑','亢','况','后','有','琴','梁丘','左丘','东门','西门','商','牟','佘','佴','伯','赏','南宫','墨','哈','谯','笪','年','爱','阳','佟','第五','言','福'],
    ['男','女'],
    [1,100],#3 年龄
    ['河北','山西','辽宁','吉林','黑龙江','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','海南','四川','贵州','云南','陕西','甘肃','青海','台湾','香港','澳门','内蒙古','广西','西藏','新疆','宁夏','北京','天津','上海','重庆'],#4 籍贯
    [1,31],#5 生日
    ['鼠','牛','虎','兔','龙','蛇','马','羊','猴','鸡','狗','猪'],
    ['白羊座','金牛座','双子座','巨蟹座','狮子座','处女座','天秤座','天蝎座','射手座','摩羯座','水瓶座','双鱼座'],
    [100,200],#8 身高
    [16,105],#9 体重
    ['美丽','漂亮','优雅','有趣','可爱','英俊','华丽','丑陋','有吸引力'],
    ['A','B','O','AB'],
    ['爸爸','父亲','爹'],
    ['母亲','妈妈','妈'],
    ['行政主管','企业主管','经理人','土木营造监工','天文学家','电脑程式设计人员','系统分析师','道景师','建筑师','交通规划师','化学工程技术师','土木工程师','造景师','测量员','销售工程师','工业工程师','品质管制工程师','陶瓷技师','药师','兽医师','公共卫生医师','中医师','护理佐理员','护理师','学前教育教师','特殊教育教师','会计师','公共关系员','律师','心理谘商师','社会工作师','人事管理师','翻译人员','人力仲介师','图书管理员','新闻记者','报刊杂志编辑人员','编剧','书籍编辑','石雕工','木雕工','漫画家','舞蹈家','乐器演奏家','营建及工程管理','钢结构设计与管理人员','微电脑','电子报/电子杂志编辑','资讯管理师','幼稚教育教师','连锁加盟店店长','行销企划','电信工程师','网页设计师','市调人员','制程工程师','土木营建机械操作工','电机工程人员','机械制图工','建筑制图人员','电子处理资料系统操作员','摄影工作人员','商船工作人员','民航运输驾驶员','轮机人员','飞航管制员','营养师','眼镜专业人员','病历管理师','保险佐理人员','推销员','证券商业务人员','销售代理人员','房地产经纪人','采购人员','进出口办事员','期货经纪人','会计员','商业美术设计师','室内设计师','播音员','美工人员','职业运动员','电视节目主持人','广告AE','国际贸易从业员','国际贸易英文文书','中文打字员','事务秘书','资料登录员','会计师助理','品质管制助理员','仓库管理人员','生产规划佐理员','供配销工作人员','邮务士','邮政工作人员','报关人员','客务管理','银行行员','金融业柜员','外汇交易员','旅行社业务员','导游人员','空中服务员','文物解说员','厨师','调酒员','西餐厨师','餐旅服务人员','保姆','美容理发师','美容师','保全工作人员','警察','消防工作人员','时装模特儿','售货员','商品售货员','宠物美容师','园艺作物栽培员','苗圃工','花匠','建筑工','水电工','工业配管工','工业配线工','室内配线工','电工','卫生配管工','磁砖铺贴设计','配线工','油漆工','汽车板金工','电焊工','一般板金工','特种电焊','铸造工','金属模具制造工','钳工','汽车修护工','汽车电系工','事务机器修护工','重机械修护工','汽车底盘工','精密磨床工','铣床工','数值控制车床操作工','冷冻空调工','冷冻空调装修工','视听电子工','工业电子工','面包烘制工','电机修护工','电器修护工','电子仪表修护工','珠宝及贵重金属制造工','精密量具制造工','乐器调音师','精密机械','陶瓷工','印刷工','印刷设计与制版人员','烘焙食品','食品及饮料技师','木模工','家俱木工','缝纫工','织布工','西装工','国服缝制人员','制鞋工','服装设计与制作人员','女装工','成衣工','热处理工','金属造型','金属表面处理工','合板制造工','冷作工','刨床工','金属电镀工','塑胶模具制造工','塑胶制品制造工','橡胶制品制造工','纸制品制造工','照相制版工','乳制品制造工','电子装配人员','汽车驾驶员','渔船船员','车床工','油气压自动控制人员','清洁服务人员','职业运动员'],
    ['阿里','腾讯',' 百度','京东',' 美团','字节跳动',' 拼多多','网易','快手','360','学校','医院','银行','工地','农场','政府机关'],
    ['小学','初中','高中','本科','硕士','博士'],
    ['微博','知乎','小红书','抖音','微信','豆瓣','贴吧'],
    ['爸爸','妈妈','哥哥','姐姐','弟弟','妹妹','爷爷','奶奶','外公','外婆','姑姑','姑父','姨妈','姨夫'],
    ['英语','中文','阿拉伯语','俄语','法语','西班牙语','德语','西班牙语','葡萄牙语','日语'],
    ['基督教','伊斯兰教','印度教','佛教','道教','锡克教','犹太教','巴哈伊信仰','耆那教','儒教','神道教','高台教','天道教','一贯道'],
    ['男','女','男女均可'],
    ['家庭保障','自由','幸福','内心平静','成熟的爱','国家安全','享乐','灵魂得到拯救','自尊','社会承认','真正的友谊','智慧','勤奋','坚韧','宽容','责任感','不自私','有主见','创造力','节俭','接纳','成就','抱负','吸引力','关心','同情心','有才能','快活','整洁','勇敢','助人','诚实','富于想象','独立','有理智','有逻辑性','钟情','顺从','有教养','负责任','自控','仁慈','舒适的生活','振奋的生活','成就感','和平的世界','美丽的世界','平等','富强','民主','文明','和谐，自由','平等','公正','法治，爱国','敬业','诚信','友善'],
    ['牺牲奉献','执着占有','悲观保留','游戏手段','婚姻目的','浪漫表达','肉体感官','真情投入'],
    ['篮球','羽毛球','兵乓球','足球','滑板','滑旱冰','跑步','跳绳','举重','听音乐','看电影','绘画','写小说','看书','做弹弓玩','做木剑玩','做橡皮枪玩','积木','用麻将搭金字塔','拼图','拆装','收藏扑克牌','收藏小汽车','收藏手表','收藏鞋','弹吉他','钢琴','萨克斯','葫芦丝','吹大号','吹小号','折纸','剪纸','品茶','涂鸦','玩英雄联盟','玩QQ堂','玩CS','玩CF','玩地下城勇士','玩飞行棋','玩国际象棋','玩真心话大冒险','玩五子棋','玩扑克牌'],
    ['明星','陈赫','陈坤','邓超','邓伦','杜淳','冯绍峰','胡歌','黄渤','黄磊','黄晓明','黄子韬','贾乃亮','李晨','李现','李易峰','林更新','鹿晗','靳东','井柏然','刘昊然','刘烨','陆毅','罗晋','沈腾','孙红雷','佟大为','王宝强','汪峰','王俊凯','王凯','王一博','王源','吴京','吴亦凡','小沈阳','肖战','徐峥','杨洋','易烊千玺','岳云鹏','张翰','张杰','张一山','张艺兴','赵文卓','郑恺','朱一龙','Angelababy','迪丽热巴','关晓彤','李冰冰','李宇春','蒋欣','刘诗诗','刘涛','刘亦菲','倪妮','宋佳','宋茜','孙俪','唐嫣','佟丽娅','谢娜','杨超越','杨幂','杨紫','姚晨','袁姗姗','张靓颖','张馨予','章子怡','赵丽颖','赵薇','周冬雨','周迅','艾伦','白敬亭','白举纲','白客','白宇','包贝尔','蔡徐坤','陈若轩','陈翔','陈晓','陈学冬','成毅','大张伟','董成鹏','董子健','窦骁','段奕宏','付辛博','高伟光','高云翔','郭京飞','郭晓东','韩栋','韩东君','韩庚','何晟铭','侯明昊','胡兵','胡海泉','胡彦斌','胡一天','华晨宇','黄景瑜','黄轩','黄宥明','姜潮','金瀚','雷佳音','李佳航','李荣浩','罗云熙','马可','马天宇','毛不易','茅子俊','聂远','欧豪','潘粤明','乔振宇','秦俊杰','任嘉伦','任重','沙溢','盛一伦','释小龙','孙坚','孙艺洲','王传君','王千源','王学兵','王迅','王栎鑫','魏晨','魏大勋','吴磊','肖央','邢昭林','徐海乔','徐开骋','许凯','许魏洲','严屹宽','杨烁','杨志刚','叶祖新','印小天','尹正','俞灏明','于和伟','于朦胧','袁弘','曾舜晞','张彬彬','张嘉益','张晋','张伦硕','张睿','张若昀','张晓龙','张译','张云龙','周一围','朱亚文','白百何','陈数','陈钰琪','陈紫函','邓家佳','董璇','高露','高圆圆','古力娜扎','海陆','海清','韩雪','胡冰卿','胡静','黄圣依','黄奕','霍思燕','吉克隽逸','贾玲','贾青','江疏影','蒋梦婕','蒋勤勤','蒋依依','江映蓉','江一燕','焦俊艳','金晨','金莎','景甜','鞠婧祎','阚清子','李菲儿','李沁','李晟','李溪芮','李小冉','李一桐','林允','刘惜君','柳岩','刘芸','娄艺潇','路晨','吕一','马丽','马思纯','马苏','马伊俐','毛晓彤','梅婷','孟美岐','戚薇','秦海璐','秦岚','尚雯婕','沈梦辰','沈月','舒畅','宋轶','宋祖儿','孙骁骁','孙怡','谭松韵','谭维维','唐艺昕','童瑶','万茜','王丽坤','王麟','王珞丹','王鸥','王蓉','王晓晨','王子文','吴谨言','吴倩','吴昕','吴宣仪','邢菲','熊乃瑾','徐娇','徐璐','杨蓉','叶璇','颖儿','郁可唯','袁冰妍','袁泉','赵韩樱子','赵露思','张碧晨','张慧雯','张静初','张俪','张檬','张含韵','张嘉倪','张天爱','张歆艺','张雪迎','张雨绮','张子枫','左小青'],
    ['跑步','高尔夫','羽毛球','游泳','钢管舞','街舞','民族舞','芭蕾舞','乐器演奏','声乐','素描','速写','书法','油画','国画','水彩画','水粉画','陶艺','手工艺','摄影','插花','茶艺','编织','剪纸','小品主持','文案写作'],
    ['深思熟虑','沉着冷静','善于自控','犹豫不决','过敏多疑','易受暗示','心境多变','多愁善感','容易冲动','活泼开朗','善于交际','独立性强','不拘小节','沉郁文静','不善交际','处事拘谨','应变力差'],
    ['米','面','杂粮，薯类','肉','禽','鱼','奶','蛋','豆类','坚果','蔬菜','水果和菌藻类'],
    ['清华或者北大本科','MIT硕士','哈佛博士','有一个自己的市值至少中国第一的公司','在世上有至少一个属于自己的刻痕','有一个非常爱我的且我非常爱的会做很多美食的女票（并且非常契合的）','有一帮过命的兄弟','有很多很多各种各样的朋友','有很多儿女','自己朋友兄弟爸妈女票儿女都活100多岁并无痛的升天','精通10国以上语言','拥有挽狂澜之即倒的能力','在有生之年改变或者目睹中国人不再冷漠','不再有坏老师','不再有坏公务员刁难百姓，不再有怀才不遇，不再有生活安全的问题（雾霾','不良食品等）','整个世界被我向着好的方向改变过','在晚年帮助别人实现梦想'],
    ['内向','爱发呆','爱发脾气','固执','焦急','交际差','心理一般','好高骛远','感情用事','文弱','惰性','土气','理想化','逻辑性不佳','爱玩游戏','不自信','坐没坐相','易被煽动','小动作','刻薄','小心眼','自私','做作','虚伪','花心','长舌','身体抵抗力差','刻板','不爱打扮','不关注文体','嗜睡','冲动','从众','废寝忘食打游戏','攀比','文笔差','不善手势','挑食','急于求成','邋遢','爱慕虚荣','嚣张','喜欢吹牛','懒惰','撒谎','做事无规划','磨蹭','嗜酒','贪小便宜','花钱大手大脚'],
    ['领导','同事','前任','父母','同学','朋友','老师','邻居'],
    [],#32 不喜欢做的事
    ['亲人的离去','孩子不争气','身体有疾病','家庭不和睦','爱人的背叛','朋友的疏离','缺少父母之爱','天灾人祸','事业失败','一蹶不振'],
    ['看鬼片','过山车','坐车','坐船','走夜路'],
    ['亲人健康','孩子争气','身体无病','家庭和睦','爱人忠诚','朋友多','事业成功','心想事成'],
    ['领导','同事','对象','父母','同学','朋友','老师','邻居'],
    ['画油画','听钢琴曲','被人抱着看电影','做饭','旅游','化妆','洗澡','疯狂买买买'],
    [],#38 想去做的事
    ['河北','山西','辽宁','吉林','黑龙江','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','海南','四川','贵州','云南','陕西','甘肃','青海','台湾','香港','澳门','内蒙古','广西','西藏','新疆','宁夏','北京','天津','上海','重庆'],
    ['黑色素瘤','蜘蛛痣','气短','咳嗽咳痰','全身症状','半年内体重大幅减轻',' 口腔溃疡反复出现','皮肤瘙痒','反复右肩痛','大便异常','牙龈出血','突发性胸痛','经常感到身体乏力'],
    ['随意评价某个人','痛打落水狗','热点事件迅速发表看法','评判他人感情','对他人长相评头论足','保持秘密','背后说别人坏话','求人办事','帮忙要钱','逢人吐槽','做无谓的反驳'],
    ['猫','狗','仓鼠','鸭子','兔子','鱼','鸟'],
    ['女儿','儿子','没有孩子'],
    [],#44 昵称（忽略）
    ['北京大学','清华大学','浙江大学','上海交通大学','南京大学','复旦大学','中国科学技术大学','华中科技大学','武汉大学','西安交通大学','吉林大学','中山大学','四川大学','哈尔滨工业大学','山东大学','南开大学','天津大学','北京师范大学','中南大学','东南大学','厦门大学','中国人民大学','北京航空航天大学','大连理工大学','西北工业大学','同济大学','华南理工大学','重庆大学','华东师范大学','兰州大学','北京理工大学','中国农业大学','湖南大学','东北大学','郑州大学','南京航空航天大学','苏州大学','华东理工大学','武汉理工大学','南京农业大','中国石油大学','北京科技大学','上海大学','西安电子科技大学','中国矿业大学','西南大学','暨南大学','电子科技大学','东北师范大学','华中师范大学'],
    ['男朋友','女朋友','单身'],
    ['老公','老婆','未婚'],
]

def check(i:int,strlst:list):
    if i==1 or i== 44:
        return 0
    if i in [3,5,8,9]:
        for x in strlst:
            if x.isdigit():
                try:
                    if str_features[i][0]<=eval(x)<=str_features[i][1]:
                        return 1
                except:
                    continue
        return 0
    if i==11:
        for x in str_features[i]:
            for j in strlst:
                if j==x:
                    #print(j,x)
                    return 1
        return 0
    for x in str_features[i]:
        for j in strlst:
            if j.count(x):
                #print(j,x)
                return 1
    return 0

def get_tuple(strlst:list):
    res=[]
    for i in range(1,47):
        if check(i,strlst)>0:
            res.append(i)
    return tuple(res)

def solve(strlst:list):
    res=[]
    for x in strlst:
        res.append(x)
        labels=get_tuple(x.split())
        if len(labels)>0:
            res.append(labels)
    if len(res) != len(strlst):
        ans.append(res)

with open('籍贯.txt',encoding='UTF-8') as f:
    for x in f.readlines():
        if len(x)!=0:
            g=x.split('、')
            if g[-1]=='\n':
                g=g[:-1]
            for y in g:
                str_features[4].append(y[:-1])
       
with open('不喜欢的事.txt',encoding='UTF-8') as f:
    for x in f.readlines():
        str_features[32].append(x.split('.')[1][:-1])

with open('想去做的事.txt',encoding='UTF-8') as f:
    for x in f.readlines():
        str_features[38].append(x.split('.')[1][:-1])
        
for fname in file_name2:
    with open(fname,encoding='UTF-8') as f:
        print(fname)
        cnt=0
        tot_data=json.load(f)
        tot=len(tot_data)
        tmp=tot//10
        for now_data in tot_data:
            conv=now_data['conversation']
            solve(conv)
            cnt+=1
            if cnt%tmp==0:
                print("{}/{}".format(cnt,tot))
print(len(ans))
with open('res2.json','w',encoding='utf-8') as f:
    f.write(json.dumps(ans,ensure_ascii=False))